/* eslint-disable */

export default function Contract() {
    return (
        <>
            <p style={{ textAlign: 'center' }}>
                <strong>توافق‌نامه‌ی سازنده</strong>
            </p>
            <p style={{ textAlign: 'justify' }}>
                خوش آمدید به توافق‌نامه‌ی سازنده ("<strong>توافق</strong>") ما که بین VTRU (BVI) PTE LTD ("ویتروو")، ثبت
                شده در جزایر ویرجین بریتانیا با شماره شرکت BVI: 2134193 و آدرس ثبت شده در c/o Hermes Corporate Service
                (BVI) Ltd., طبقه ۶، Waters Edge، ساختمان ۱، Wickham's Cay 2، Road Town، تورتولا، جزایر ویرجین بریتانیا
                ("شرکت")، و شما ("<strong>شما</strong>") به عنوان "<strong>طرفین</strong>" انجام شده است.
            </p>
            <p style={{ textAlign: 'justify' }}>
                به منظور این توافق‌نامه، "کاربر"، "شما" و "شما" به عنوان کاربر سرویس تعبیر می‌شوند. اگر از سرویس به
                نمایندگی از یک شرکت یا دیگر موجودیت استفاده می‌کنید، "شما" شامل شما و آن موجودیت می‌شود و شما اظهار و
                گواهی می‌دهید که (a) شما نماینده اختیار شده موجودیت با اختیار برای ملزم کردن موجودیت به این شرایط هستید،
                و (b) شما با این توافق‌نامه به نمایندگی از موجودیت با این شرایط موافقت می‌کنید.
            </p>
            <p style={{ textAlign: 'justify' }}>
                ویتروو یک ارائه‌دهنده کیف پول، صراف، کارگزار، دلال، نهاد مالی، فرآیندگر پرداخت، کسب و کار خدمات پولی یا
                بدهی نیست. ویتروو یک پروتکل Web3 ارائه می‌دهد که به سازندگان اجازه می‌دهد دارایی‌های خود را بارگذاری
                کرده و کار خود را برای جبران منصفانه طبق شرایطی که آنها کنترل می‌کنند، مجوز دهند. ما نظارت یا کنترلی بر
                روی دارایی‌ها نداریم. برای استفاده از سرویس ما، شما باید از یک کیف پول شخص ثالث استفاده کنید که به شما
                اجازه می‌دهد در تعاملات با پروتکل ما شرکت کنید.
            </p>
            <p style={{ textAlign: 'justify' }}>
                <strong>زمینه:</strong>
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                1. شرکت یک اکوسیستم اختصاصی به تقویت سازندگان در Web3 است.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                2. سازنده می‌خواهد از پلتفرم شرکت برای نمایش و ترویج کار خلاقانه خود به مخاطبان گسترده‌تر استفاده کند.
            </p>
            <p style={{ marginRight: '-3px', textAlign: 'justify' }}>
                <strong>بنابراین، طرفین به شرح زیر موافقت می‌کنند:</strong>
            </p>
            <p style={{ marginRight: '-3px', textAlign: 'justify' }}>&nbsp;</p>
            <p style={{ textAlign: 'justify' }}>
                <strong>1.</strong> <strong>تعریف کاربر:</strong>
            </p>
            <p style={{ marginLeft: 76, textAlign: 'justify' }}>
                1.1 به منظور این توافق‌نامه، "کاربر" به هر فرد یا موجودیتی که به سرویس‌های ارائه‌شده توسط شرکت دسترسی
                دارد، مراجعه می‌شود، از جمله اما محدود به بازدیدکنندگان، کاربران ثبت‌نام‌شده، سازندگان، خریداران، فروش
                ارندگان و هر شخص دیگری که با یا از پلتفرم شرکت در ارتباط باشد یا از آن استفاده کند. با دسترسی یا استفاده
                از خدمات شرکت، هر کاربر موافقت می‌کند که به شرایط و هر دستورالعمل یا رهنمود دیگری که توسط شرکت اعلام شده
                است، احترام بگذارد.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                1.2 کاربران حق دسترسی و استفاده از پلتفرم و خدمات شرکت را دارند، با رعایت شرایط و هر قوانین، مقررات یا
                سیاست‌های قابل اجرا. کاربران مسئول دقت، قانونی بودن و ملائم بودن محتوایی که در پلتفرم شرکت بارگذاری، به
                اشتراک گذاری یا در دسترس دیگران قرار می‌دهند، هستند. شرکت حق دارد شرایط را اجرا کند، دسترسی یک کاربر را
                تعلیق یا لغو کند یا اقدامات مناسبی را انجام دهد اگر کاربر در نقض شرایط باشد یا در رفتاری مضر به پلتفرم
                یا سایر کاربران اشتباه کند.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>2. اعطای مجوز:</strong> سازنده یک مجوز غیرانحصاری، جهانی و بدون هزینه به شرکت می‌دهد تا محتوای
                سازنده (شامل اما محدود به آثار هنری، رسانه و هر متاداده مرتبط دیگر) را در پلتفرم شرکت و به منظور اهداف
                تبلیغاتی مرتبط با پلتفرم استفاده، تولید، توزیع، نمایش و اجرا کند.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>3. استفاده از لایسنس Creative Commons:</strong>
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                a. سازنده اذعان و موافقت می‌کند که امکان دارد لایسنس‌های Creative Commons را به محتوای خود که در پلتفرم
                شرکت بارگذاری شده است، اعمال کند.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                b. با انتخاب اعمال لایسنس Creative Commons به محتوای خود، سازنده اجازه می‌دهد که کاربران دیگر از اثر طبق
                شرایط لایسنس Creative Commons انتخابی استفاده کنند.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>4.</strong> <strong>حقوق مالکیت فکری:</strong> سازنده تمام حقوق، عنوان و علاقه‌مندی خود را در
                محتوای اصلی که به پلتفرم شرکت بارگذاری می‌شود، حفظ می‌کند. شرکت تأیید می‌کند که هیچ انتقال مالکیتی از
                هیچ حقوق مالکیت فکری توسط این توافق‌نامه انجام نمی‌شود یا تلمیح نمی‌شود.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>5.</strong> <strong>دستورالعمل‌های محتوا:</strong> سازنده موافقت می‌کند هیچ محتوایی که حق تکثیر،
                علامت تجاری، حریم خصوصی یا هر حق دیگری را نقض کند یا غیرقانونی، توهین‌آمیز یا نامناسب باشد، بارگذاری یا
                ترویج نکند. شرکت حق دارد هر محتوایی که با این دستورالعمل‌ها تضاد داشته باشد را حذف کند. سازنده ضمانت
                می‌دهد که محتوای بارگذاری‌شده اصلی و اصیل است و تنها متعلق به سازنده است.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>6. جبران خدمات:</strong> هر گونه جبران یا تقسیم درآمد برای محتوای سازنده در پلتفرم شرکت در یک
                توافق جداگانه یا مطابق با سیاست‌های پلتفرم به سازنده اطلاع‌رسانی می‌شود.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>7. </strong> <strong>ماده اعلام نقض:</strong>
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                7.1 شرکت به سرعت اثرات را در پلتفرم خود در پاسخ به ادعاهای نقض حقوق مالکیت فکری، مطابق با روش اسقاط ذیل،
                برمی‌دارد.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                اگر اعتقاد دارید که محتوای شما به نحوی که حق تکثیر یا علامت تجاری را نقض می‌کند یا حقوق انتشار یا دیگر
                حقوق مالکیت فکری شما را نقض می‌کند، لطفاً اعلام نقض خود را ارسال کنید.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>7.2 روش اسقاط:</p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                a. اعلام نقض باید به صورت کتبی ارسال شود و شامل موارد زیر باشد:
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                · شناسایی اثر(های) حق تکثیر، علامت تجاری، حقوق انتشار یا سایر حقوق مالکیت فکری که ادعا می‌شود که نقض
                شده‌اند.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                · شناسایی مواد ادعاشده نقض، شامل جزئیات مکان خاص (مانند URLها) در سرویس که مواد در آن یافت می‌شود.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                · اطلاعات تماس شما، شامل نام کامل قانونی شما و آدرس ایمیل شما.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>· اظهارنامه که شامل:</p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                &nbsp;i. اظهارنامه تایید اینکه اعتقاد خود را دارید استفاده از مواد توسط صاحب حقوق مالکیت فکری یا نماینده
                او یا طبق قانون مجاز نیست.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                &nbsp;ii. تأیید دقت اطلاعات ارائه‌شده در اطلاع‌رسانی.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                &nbsp;iii. اظهارنامه تحت هر گونه عقوبت دروغگویی که تایید می‌کند که شما مجاز به اقدام به نمایندگی از صاحب
                حقوق مالکیت فکری هستید.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>7.3 نماینده مختص:</p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                a. شرکت یک نماینده را برای دریافت و پردازش اطلاعیه‌های اسقاط معین می‌کند، اطلاعات تماس که درخواست شود به
                سازندگان ارائه خواهد شد.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>7.4 عمل به دریافت اطلاعیه اسقاط:</p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                a. پس از دریافت یک اطلاعیه اسقاط معتبر، شرکت به سرعت مطالعه ادعا را انجام داده و در صورت لزوم، مواد
                ادعاشده را حذف یا دسترسی به آن را غیرفعال می‌کند.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                b. پس از دریافت اطلاعیه نقض حقوق مالکیت فکری، شامل اطلاعات تماس شما، شرکت این اطلاعات را به طرف مسئول
                برای حذف محتوا منتقل خواهد کرد. این امکان را برای آنها فراهم می‌کند تا دلیل حذف را درک کرده و برای حل
                اختلاف با شما تماس بگیرند.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                7.5 عدم مسئولیت: شرکت مسئولیتی از آسیب‌های ناشی از اقدامات نیکوکارانه‌ای که به دنبال اطلاعیه اسقاط باشد،
                نخواهد داشت. شرکت حق دارد دسترسی یک کاربر به سرویس را متوقف کند اگر مشخص شود که کاربر تکراراً نقض کننده
                است.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>8.</strong> <strong>استفاده از دارایی‌ها به منظور اهداف بازاریابی:</strong>
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>8.1 &nbsp; فعال‌سازی و غیرفعال‌سازی:</p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                a. سازنده کنترل کامل بر استفاده از محتوای خود (مشارکت به عنوان "دارایی") که در پلتفرم برای اهداف
                بازاریابی بارگذاری شده است، را حفظ می‌کند. سازنده حق فعال یا غیرفعال کردن استفاده از دارایی خود را به
                خصوص برای اهداف بازاریابی را دارد.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                b. به طور پیش‌فرض، تمام دارایی‌های بارگذاری‌شده بر روی پلتفرم شرکت برای نمایش یا اهداف تبلیغاتی باید
                برای استفاده در بازاریابی غیرفعال باشند مگر اینکه سازنده به صراحت این مجوز را فعال کند.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>8.2 &nbsp; مجوز برای استفاده در بازاریابی:</p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                a. سازنده به شرکت مجوز محدود برای استفاده از دارایی به منظور اهداف بازاریابی را اعطا می‌کند، تنها زمانی
                که سازنده چنین مجوزی را از طریق ویژگی فعال‌سازی/غیرفعال‌سازی مشخص پلتفرم فعال کرده باشد.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                b. سازنده اذعان و موافقت می‌کند که فعال‌سازی دارایی خود برای اهداف بازاریابی، مالکیت یا حقوق دیگری را به
                شرکت فراهم نمی‌کند خارج از مجوز محدود مشخص‌شده.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>8.3 &nbsp; لغو مجوز:</p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                a. سازنده حق غیرفعال کردن استفاده از دارایی خود به منظور اهداف بازاریابی را در هر زمان از طریق ویژگی‌های
                مشخص پلتفرم یا ارائه اطلاع‌نامه به شرکت حفظ می‌کند.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                b. هنگامی که سازنده غیرفعال کند، شرکت باید به سرعت استفاده از دارایی برای اهداف بازاریابی را متوقف کند،
                مگر در مواردی که برای اهداف بایگانی، قانونی یا اداری لازم باشد.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>8.4 &nbsp; مسئولیت سازنده:</p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>
                a. سازنده اذعان و موافقت می‌کند که تنها او مسئول فعال یا غیرفعال‌سازی مجوز استفاده از دارایی خود در
                پلتفرم شرکت است.
            </p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>
                b. شرکت در برابر هرگونه پیامدهای ناشی از انتخاب‌های فعال‌سازی یا غیرفعال‌سازی سازنده برای اهداف
                بازاریابی مسئولیت نخواهد داشت.
            </p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>8.5 نمایندگی:</p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>
                هر دو طرف تصریح می‌کنند که مکانیزم فعال‌سازی/غیرفعال‌سازی را درک می‌کنند و موافقت می‌کنند که فعال‌سازی
                دارایی به منظور اهداف بازاریابی به عنوان اجازه صریح اعطاشده توسط سازنده به شرکت برای چنین استفاده
                محدودیت‌داری تلقی خواهد شد.
            </p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>8.6 تأثیر بر شرایط دیگر:</p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>
                این بند به عنوان مکمل عمل خواهد کرد و هیچ‌کدام از مفاد دیگر این توافق مرتبط با استفاده از محتوا، اجاره
                یا حقوق مالکیت فکری را نادیده نمی‌گیرد.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>9.</strong> <strong>پایان:</strong> هر یک از طرفین می‌توانند این توافق را با ارائه اطلاع‌نامه
                کتبی به طرف دیگر پایان دهند. پس از پایان، شرکت باید استفاده از محتوای سازنده را متوقف کند، مگر در مواردی
                که برای اهداف بایگانی، قانونی یا اداری لازم باشد.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>10.</strong> <strong>اطلاع:</strong> هر گونه اطلاع یا ارتباط دیگری که به شرکت در زیر یا در
                ارتباط با این قرارداد داده شود، باید به صورت کتبی باشد و باید: تحویل دستی، پیک یا ایمیل به آدرس مجاز به
                شرح زیر باشد:
            </p>
            <ul>
                <li style={{ listStyleType: 'disc' }}>
                    آدرس: 6th Floor, Waters Edge، Building 1، Wickham’s Cay 2، Road Town، Tortola، British Virgin
                    Islands&nbsp;
                </li>
                <li style={{ listStyleType: 'disc' }}>ایمیل: nik@vitruveo.xyz</li>
            </ul>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>11.</strong> <strong>تضمین: </strong>سازنده موافقت می‌کند که شرکت، وابستگان آن، مدیران، کارکنان،
                نمایندگان، و مجوزدهندگان خود را از هر گونه ادعا، مسئولیت، خسارت، زیان، و هزینه‌های ناشی از استفاده از
                پلتفرم شرکت یا هر نقضی از این توافق محافظت و معاف نگه دارد.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>12.</strong> <strong>تضمین و اظهارات:</strong> هر دو طرف اظهار و تضمین می‌کنند که دارای توان و
                اختیار کامل برای ورود به این توافق و انجام تعهدات خود در اینجا هستند.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>13.</strong>&nbsp; <strong>قانون حاکم:</strong> این توافق توسط قوانین جزایر ویرجین بریتانیا حاکم
                و طبق آن تفسیر می‌شود، بدون توجه به اصول تعارض قوانین آن.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>14.</strong>&nbsp; <strong>توافق کل:</strong> این توافق تمامیت تفاهم بین طرفین در مورد موضوع
                اینجا را تشکیل می‌دهد و تمام توافق‌نامه‌ها، بحث‌ها، یا تفاهمات قبلی را نادیده می‌گیرد.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>15.</strong>&nbsp; <strong>تغییرات:</strong> هر گونه تغییر یا اصلاح به این توافق باید به صورت
                کتبی انجام شده و توسط هر دو طرف امضا گردد.
            </p>
            <p style={{ marginLeft: 20, marginRight: 7, textAlign: 'justify' }}>
                این توافق توسط ویتروو و سازنده توسط امضای الکترونیکی کیف پول دیجیتال شما انجام شده است.
            </p>
        </>
    );
}
