/* eslint-disable */

export default function Contract() {
    return (
        <>
            <p style={{ textAlign: 'center' }}>
                <strong>СОГЛАШЕНИЕ СОЗДАТЕЛЯ</strong>
            </p>
            <p style={{ textAlign: 'justify' }}>
                Добро пожаловать в наше Соглашение Создателя ("<strong>Соглашение</strong>") между VTRU (BVI) PTE LTD (“
                <strong>Vitruveo</strong>”), зарегистрированной на Британских Виргинских островах под номером компании
                BVI: 2134193 с зарегистрированным офисом по адресу c/o Hermes Corporate Service (BVI) Ltd., 6th Floor,
                Waters Edge, Building 1, Wickham’s Cay 2, Road Town, Tortola, Британские Виргинские острова (“
                <strong>Компания</strong>”), и&nbsp;(<strong>“Вы”),</strong>
                &nbsp;совместно называемые "<strong>Стороны</strong>."
            </p>
            <p style={{ textAlign: 'justify' }}>
                Для целей настоящего Соглашения, "пользователь", "вы" и "ваш" означают вас как пользователя Сервиса.
                Если вы используете Сервис от имени компании или другого юридического лица, то "вы" включает вас и это
                юридическое лицо, и вы заявляете и гарантируете, что (а) вы являетесь уполномоченным представителем
                юридического лица с полномочиями связывать юридическое лицо с настоящими Условиями, и (б) вы
                соглашаетесь с условиями настоящего Соглашения от имени юридического лица.
            </p>
            <p style={{ textAlign: 'justify' }}>
                Vitruveo не является поставщиком кошельков, биржей, брокером, дилером, финансовым учреждением, платежным
                процессором, денежным сервисным бизнесом или кредитором. Vitruveo предоставляет протокол Web3, который
                позволяет создателям загружать активы и лицензировать свои работы для справедливой компенсации в
                соответствии с условиями, которыми они управляют. У нас нет хранения или контроля над активами. Для
                использования нашего Сервиса вам необходимо использовать кошелек третьей стороны, который позволяет вам
                совершать транзакции на нашем протоколе.
            </p>
            <p style={{ textAlign: 'justify' }}>
                <strong>Фон:</strong>
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                1. Компания - экосистема, посвященная поддержке создателей в рамках Web3.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                2. Создатель желает использовать платформу компании для демонстрации и продвижения своих творческих
                работ перед широкой аудиторией.
            </p>
            <p style={{ marginRight: '-3px', textAlign: 'justify' }}>
                <strong>Следовательно, стороны соглашаются следующим образом:&nbsp;</strong>
            </p>
            <p style={{ marginRight: '-3px', textAlign: 'justify' }}>&nbsp;</p>
            <p style={{ textAlign: 'justify' }}>
                <strong>1.</strong> <strong>Определение Пользователя:</strong>
            </p>
            <p style={{ marginLeft: 76, textAlign: 'justify' }}>
                1.1 В целях настоящего соглашения "Пользователь" означает любое физическое или юридическое лицо,
                получающее доступ, просматривающее или использующее услуги, предоставляемые компанией, включая, но не
                ограничиваясь, посетителями, зарегистрированными пользователями, создателями, покупателями, продавцами и
                любым другим лицом, взаимодействующим с платформой компании или использующим ее. Пользуясь услугами
                компании или получая к ним доступ, каждый Пользователь соглашается соблюдать условия и любые другие
                политики или руководящие принципы, установленные компанией.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                1.2 Пользователи имеют право получать доступ к платформе и услугам компании, при условии соблюдения
                условий и применимых законов, правил или политик. Пользователи несут ответственность за точность,
                законность и соответствие содержимого, которое они загружают, делятся или иным образом делают доступным
                на платформе компании. Компания оставляет за собой право применять условия, приостанавливать или
                прекращать доступ Пользователя или предпринимать соответствующие меры, если Пользователь нарушает
                условия или ведет себя таким образом, что наносит ущерб платформе или другим Пользователям.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>2. Предоставление лицензии:</strong> Создатель предоставляет компании неисключительную, мировую,
                безвозмездную лицензию на использование, воспроизведение, распространение, отображение и исполнение
                контента Создателя (включая, но не ограничиваясь, произведениями искусства, медиа и любыми связанными
                метаданными) на платформе компании и в целях продвижения платформы.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>3.&nbsp; Использование лицензий Creative Commons:</strong>
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                a. Создатель признает и соглашается с тем, что у него есть возможность применять лицензии Creative
                Commons к своему контенту, загруженному на платформу компании.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                b. Выбрав применение лицензии Creative Commons к своему контенту, Создатель предоставляет разрешение
                другим пользователям использовать работу в соответствии с условиями выбранной лицензии Creative Commons.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>4.</strong> <strong>Права интеллектуальной собственности:</strong> Создатель сохраняет все
                права, права собственности и интересы в отношении своего оригинального контента, загруженного на
                платформу компании. Компания признает, что настоящим Соглашением не происходит передача собственности
                над интеллектуальными правами.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>5.</strong> <strong>Руководящие принципы контента:</strong> Создатель соглашается не загружать и
                не продвигать контент, который нарушает авторские права, товарные знаки, конфиденциальность или любые
                другие права, или является незаконным, клеветническим или неприемлемым. Компания оставляет за собой
                право удалять любой контент, нарушающий эти руководящие принципы. Создатель гарантирует, что загружаемый
                контент является оригинальным, подлинным и полностью принадлежит Создателю.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>6. Компенсация:</strong> Любая компенсация или распределение доходов за контент Создателя на
                платформе компании будет оговорена в отдельном соглашении или в соответствии с политиками платформы, о
                которых будет сообщено Создателю.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>7. </strong> <strong>Процедура удаления при нарушении прав:</strong>
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                7.1 Компания незамедлительно удаляет работы с платформы в ответ на претензии о нарушении
                интеллектуальных прав, в соответствии с процедурой удаления, описанной ниже.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                Если вы считаете, что ваш контент был скопирован таким образом, что это составляет нарушение авторских
                или товарных прав или нарушает ваши права на публичность или другие интеллектуальные права, отправьте
                уведомление о нарушении.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>7.2 Процедура удаления:</p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                a. Уведомление о снятии должно быть представлено в письменной форме и содержать следующее:
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                · &nbsp; Идентификация авторских прав, товарного знака, прав на публичность или других интеллектуальных
                прав, которые утверждаются нарушенными.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                · &nbsp; Идентификация предполагаемого нарушающего материала, включая конкретные сведения о его
                местонахождении (например, URL-адресах) на Сервисе.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                · &nbsp; Ваши контактные данные, включая ваше полное юридическое имя и адрес электронной почты.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                · &nbsp; Заявление,
                содержащее:&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                &nbsp;&nbsp;&nbsp;i. Заявление, подтверждающее вашу добросовестную веру в том, что использование
                материала не авторизовано правообладателем интеллектуальной собственности, его агентом или
                законом.&nbsp;
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                &nbsp;&nbsp;&nbsp;ii. Утверждение о точности предоставленной информации в уведомлении.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                &nbsp;&nbsp;iii. Заявление под присягой о том, что вы имеете право действовать от имени правообладателя
                интеллектуальной собственности.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>7.3&nbsp; Уполномоченный агент:</p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                a. Компания назначает агента для получения и обработки уведомлений о снятии, контактные данные которого
                будут предоставлены Создателям по запросу.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                7.4&nbsp; Действия при получении уведомления о снятии:
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                a. После получения действительного уведомления о снятии, компания незамедлительно проведет расследование
                и, при необходимости, удалит или отключит доступ к предполагаемому нарушающему материалу.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                b. После получения вашего уведомления о нарушении интеллектуальных прав, включая ваши контактные данные,
                компания передаст эту информацию заинтересованной стороне, ответственной за удаление контента. Это
                позволяет им понять причину удаления и связаться с вами для разрешения спора.
            </p>
            <p style={{ marginLeft: 72, textAlign: 'justify' }}>
                7.5&nbsp; Отсутствие ответственности: Компания не несет ответственности за любые убытки, возникшие в
                результате добросовестных действий, предпринятых в ответ на уведомление о снятии. Компания имеет право
                прекратить доступ пользователя к Сервису, если пользователь будет признан повторным нарушителем.
            </p>
            <p style={{ textAlign: 'justify' }}>
                &nbsp;<span style={{ fontFamily: 'Arial,sans-serif' }}> </span>
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>8.</strong> <strong>Использование активов в маркетинговых целях:</strong>
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>8.1 &nbsp; Активация и деактивация:</p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                a. Создатель полностью контролирует использование своего контента (называемого "Активом"), загруженного
                на платформу для маркетинговых целей. Создатель оставляет за собой право активировать или деактивировать
                использование своего Актива специально для маркетинговых целей.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                b. По умолчанию все Активы, загруженные на платформу компании для отображения или промоушн целей, будут
                неактивными для маркетингового использования, если Создатель явно не активирует это разрешение.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                8.2 &nbsp; Разрешение на маркетинговое использование:
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                a. Создатель настоящим предоставляет компании ограниченное разрешение на использование Актива только в
                маркетинговых целях, когда Создатель активировал такое разрешение через соответствующую функцию
                активации/деактивации платформы.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                b. Создатель признает и соглашается с тем, что активация его Актива для маркетинговых целей не является
                передачей собственности или каких-либо других прав компании, кроме указанного ограниченного разрешения.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>8.3 &nbsp; Отзыв разрешения:</p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                a. Создатель оставляет за собой право деактивировать использование своего Актива для маркетинговых целей
                в любое время через соответствующие функции платформы или предоставив письменное уведомление компании.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>
                b. После деактивации Создателем компания незамедлительно прекратит использование Актива для
                маркетинговых целей, за исключением случаев, когда это необходимо для архивных, юридических или
                административных целей.
            </p>
            <p style={{ marginLeft: 96, textAlign: 'justify' }}>8.4 &nbsp; Обязанность Создателя:</p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>
                a. Создатель признает и соглашается с тем, что он несет полную ответственность за активацию или
                деактивацию разрешения на маркетинговое использование своего Актива на платформе компании.
            </p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>
                b. Компания не несет ответственности за последствия, возникающие из выбора Создателя при активации или
                деактивации для маркетинговых целей.
            </p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>8.5 Представительство:&nbsp;</p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>
                Обе Стороны заявляют, что они понимают механизм активации/деактивации и соглашаются с тем, что активация
                Актива для маркетинговых целей будет рассматриваться как явное разрешение, предоставленное Создателем
                компании для такого ограниченного использования.
            </p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>8.6 Влияние на другие условия:&nbsp;</p>
            <p style={{ marginLeft: 100, textAlign: 'justify' }}>
                Настоящая статья дополняет и не заменяет другие положения, изложенные в настоящем Соглашении, касающиеся
                использования контента, лицензирования или прав интеллектуальной собственности.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>9.</strong> <strong>Прекращение:</strong> Любая из сторон может прекратить настоящее Соглашение,
                предоставив письменное уведомление другой стороне. По окончании компания прекратит использование
                контента Создателя, за исключением случаев, когда это необходимо для архивных, юридических или
                административных целей.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>10.</strong> <strong>Уведомление: </strong>Любое уведомление или иное сообщение, направленное
                Компании в соответствии с настоящим договором, должно быть в письменной форме и должно быть: доставлено
                лично, курьером или по электронной почте по&nbsp; уполномоченному адресу&nbsp; следующим образом:
            </p>
            <ul>
                <li style={{ listStyleType: 'disc' }}>
                    Адрес: 6-й этаж, Waters Edge, &nbsp; Building 1, Wickham’s Cay 2, Road Town, Tortola, British Virgin
                    Islands&nbsp;
                </li>
                <li style={{ listStyleType: 'disc' }}>Электронная почта: nik@vitruveo.xyz</li>
            </ul>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>11.</strong> <strong>Индемнизация: </strong>Создатель соглашается возместить убытки и защитить
                компанию, ее аффилированные лица, директоров, сотрудников, агентов и лицензиаров от любых претензий,
                обязательств, убытков, потерь и расходов, возникших в связи с использованием Создателем платформы
                компании или нарушением настоящего Соглашения.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>12.</strong> <strong>Заявления и гарантии:</strong> Обе стороны заявляют и гарантируют, что они
                имеют полномочия вступить в настоящее Соглашение и выполнить свои обязательства по нему.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>13.</strong>&nbsp; <strong>Применимое право:</strong> Настоящее Соглашение регулируется и
                толкуется в соответствии с законами Британских Виргинских островов, без применения принципов коллизии
                законов.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>14.</strong>&nbsp; <strong>Целостность соглашения:</strong> Настоящее Соглашение является полным
                соглашением между Сторонами относительно предмета настоящего Соглашения и заменяет все предыдущие
                соглашения, обсуждения или понимания.
            </p>
            <p style={{ marginLeft: 48, textAlign: 'justify' }}>
                <strong>15.</strong>&nbsp; <strong>Изменения:</strong> Любые изменения или модификации настоящего
                Соглашения должны быть сделаны в письменной форме и подписаны обеими Сторонами.
            </p>
            <p style={{ marginLeft: 20, marginRight: 7, textAlign: 'justify' }}>
                Настоящее Соглашение заключено между Vitruveo и Создателем путем электронной подписи вашего цифрового
                кошелька.
            </p>
        </>
    );
}
